app/Services/OwnerServicesService.php

    public static function getOwnerServices(Authenticatable $user): Collection
    {
        return Service::with(['types',
            'schedules' => function ($q) {
                $q->whereDate('work_day', '>=', date('Y.m.d'));
            }])
            ->select('services.*')
            ->where('user_id', $user->id)
            ->get();
---
select `schedules`.*, `types`.`name` from `schedules` inner join `types` on `schedules`.`service_type_id` = `types`.`id` where `schedules`.`service_id` in (6, 7, 10) and date(`work_day`) >= '2021.03.19'
select `services`.* from `services` where `user_id` = 13
select `types`.*, `services_types`.`service_id` as `pivot_service_id`, `services_types`.`type_id` as `pivot_type_id` from `types` inner join `services_types` on `types`.`id` = `services_types`.`type_id` where `services_types`.`service_id` in (6, 7, 10)