app/Http/Controllers/API/ServicesController.php

    public function index(Request $request) {
        if($request->has('city')) {
            $city=urldecode(request()->get('city'));
            return response()->json(Service::query()
                ->where('city',$city)
                ->with('types')->get(),
                200,[],JSON_UNESCAPED_UNICODE);
        }
        return response()->json(Service::query()
            ->with('types')->get(),
            200, [],JSON_UNESCAPED_UNICODE);
---
select * from `services` where `city` = 'Балашиха'
select `types`.*, `services_types`.`service_id` as `pivot_service_id`, `services_types`.`type_id` as `pivot_type_id` from `types` inner join `services_types` on `types`.`id` = `services_types`.`type_id` where `services_types`.`service_id` in (6, 9, 11, 34, 55, 68, 118, 177)

    public function cityList() {
        return response()->json(Service::query()->select('city')->distinct()->orderBy('city')->get(),200,[],JSON_UNESCAPED_UNICODE);
---
select distinct `city` from `services` order by `city` asc

    public function typeList() {
        return response()->json(Type::query()->select('name')->get(), 200,[],JSON_UNESCAPED_UNICODE);
---
select `id`, `name` from `types`